development/TODOs_source.html

<div id="outline-container-orgb2725c7" class="outline-2">
<h2 id="orgb2725c7">new todos (attempt to clean up old todos)</h2>
<div class="outline-text-2" id="text-orgb2725c7">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> present the three states for Notes.md as file diffs?</li>
<li class="off"><code>[&#xa0;]</code> consider adding following links to wiki notes
<ul class="org-ul">
<li><a href="https://groups.google.com/forum/#!topic/ledger-cli/iVkcAOYo7Ag/discussion">Resetting income/expense accounts to zero yearly..</a></li>
<li><a href="https://groups.google.com/forum/#!topic/ledger-cli/M5T_H-bxGh0/discussion">Automated transaction with variable amount</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> try to do some grouping of recently sorted todos below</li>
<li class="off"><code>[&#xa0;]</code> IRC user reports transaction with no description is not display
in home page (previously reported as issue with commodity)</li>
<li class="off"><code>[&#xa0;]</code> if file only has an empty line, then a transaction, cone treats
it as a comment.</li>
<li class="off"><code>[&#xa0;]</code> improve layout of wiki</li>
<li class="off"><code>[&#xa0;]</code> pull recent additions to business logic into cone<sub>lib</sub></li>
<li>a note on some links about locales and amounts
<ul class="org-ul">
<li><a href="https://community.appway.com/screen/kb/article/formatting-integers-according-to-locale-1482810848119">https://community.appway.com/screen/kb/article/formatting-integers-according-to-locale-1482810848119</a></li>
<li><a href="https://www.w3.org/International/wiki/Locale-based_forms">https://www.w3.org/International/wiki/Locale-based_forms</a></li>
<li><a href="https://docs.microsoft.com/en-us/globalization/locale/number-formatting">https://docs.microsoft.com/en-us/globalization/locale/number-formatting</a></li>
<li><a href="https://docs.oracle.com/cd/E19455-01/806-0169/6j9hsml2h/index.html">https://docs.oracle.com/cd/E19455-01/806-0169/6j9hsml2h/index.html</a></li>
<li><a href="https://developer.android.com/training/basics/supporting-devices/languages">https://developer.android.com/training/basics/supporting-devices/languages</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> research Focus widgets, API, in hopes of some simplifications</li>
<li class="off"><code>[&#xa0;]</code> try SelectableText
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=ZSU3ZXOs6hc">https://www.youtube.com/watch?v=ZSU3ZXOs6hc</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> try DataTable
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=ktTajqbhIcY&amp;list=PLjxrf2q8roU23XGwz3Km7sQZFTdB996iG&amp;index=57">https://www.youtube.com/watch?v=ktTajqbhIcY&amp;list=PLjxrf2q8roU23XGwz3Km7sQZFTdB996iG&amp;index=57</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> try LicensePage widget</li>
<li class="off"><code>[&#xa0;]</code> try on raw key input to make TAB key work</li>

<li class="off"><code>[&#xa0;]</code> now that we are allowing another mimetype, add heuristics

<ul class="org-ul">
<li>make mimetype viewable by user</li>
<li>make contents of file viewable by user, even after the planned
changes to homescreen</li>
<li>add tests for different line endings, different file encodings,
maybe even right to left text</li>
<li>experiment with heuristics for reasonable data. parsing the file and
finding transactions, etc, is one clue. but if the parsing is only
looking for positive results, as we do now, it's not telling us if
the ledger file is invalid.

<ul class="org-ul">
<li>we could consider some existing dart tools

<ul class="org-ul">
<li><a href="https://pub.dev/packages/validators">https://pub.dev/packages/validators</a></li>
<li><a href="https://pub.dev/packages?q=convert">https://pub.dev/packages?q=convert</a></li>
</ul></li>
</ul></li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> look for idioms for clis written for dart apps

<ul class="org-ul">
<li><a href="https://github.com/dart-lang/sdk/blob/master/runtime/bin/main_options.cc">https://github.com/dart-lang/sdk/blob/master/runtime/bin/main_options.cc</a></li>
<li><a href="https://github.com/dart-lang/stagehand/blob/master/pubspec.yaml#L22">https://github.com/dart-lang/stagehand/blob/master/pubspec.yaml#L22</a></li>
<li><a href="https://github.com/dart-lang/dartdoc/blob/master/bin/dartdoc.dart#L46">https://github.com/dart-lang/dartdoc/blob/master/bin/dartdoc.dart#L46</a></li>
<li><a href="https://github.com/flutter/flutter/blob/master/packages/flutter_tools/bin/flutter_tools.dart#L7">https://github.com/flutter/flutter/blob/master/packages/flutter_tools/bin/flutter_tools.dart#L7</a></li>
<li><a href="https://github.com/dart-lang/sdk/issues/26578">https://github.com/dart-lang/sdk/issues/26578</a> a little
discussion on distributing clis</li>
<li><a href="https://github.com/dart-lang/sdk/wiki/Snapshots">https://github.com/dart-lang/sdk/wiki/Snapshots</a></li>
<li><a href="https://dart.dev/tools/dart-vm#snapshot-option">https://dart.dev/tools/dart-vm#snapshot-option</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org43ff7bc" class="outline-2">
<h2 id="org43ff7bc">old todos</h2>
<div class="outline-text-2" id="text-org43ff7bc">
</div>
<div id="outline-container-org7f465cc" class="outline-3">
<h3 id="todo-later"><a id="org7f465cc"></a><span class="todo TODO">TODO</span> later</h3>
<div class="outline-text-3" id="text-todo-later">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> try flutter snapshots plugin to provide screenshots for fdroid</li>

<li class="off"><code>[&#xa0;]</code> improve the addition of rows UI</li>

<li class="off"><code>[&#xa0;]</code> cleanup the date item</li>

<li class="off"><code>[&#xa0;]</code> try developing on desktop</li>

<li class="off"><code>[&#xa0;]</code> ensure app works at various</li>

<li class="off"><code>[&#xa0;]</code> improve logging in java channel</li>

<li class="off"><code>[&#xa0;]</code> investigate all the methods leading up to the box issue, such as
permissions, etc</li>

<li>review fdroid build notes

<ul class="org-ul">
<li><a href="https://gitlab.com/fdroid/fdroidserver/issues/511">https://gitlab.com/fdroid/fdroidserver/issues/511</a></li>
<li><a href="https://gitlab.com/fdroid/fdroiddata/merge_requests/3739">https://gitlab.com/fdroid/fdroiddata/merge_requests/3739</a></li>
<li>review the gradle build file</li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> press back twice to leave app from home page</li>

<li class="off"><code>[&#xa0;]</code> determine if we can specify multiple mime types, or use a heuristic
to check if a file contains plain text</li>

<li class="off"><code>[&#xa0;]</code> refactor append to only look at previous contents, not edit. use
trim in transaction's print if needed</li>

<li class="off"><code>[&#xa0;]</code> add linting workflow suggestions</li>

<li class="off"><code>[&#xa0;]</code> improve selection of currencies, so users can search if they're not
sure the three letter code, for example Mexican Peso is MXN.</li>

<li class="off"><code>[&#xa0;]</code> add parser code</li>

<li class="off"><code>[&#xa0;]</code> continue efforts on user configurability of ledger location</li>

<li class="off"><code>[&#xa0;]</code> add notes on how to add a language to localizations</li>

<li>currency issues

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> make widget resize to that of contained text</li>
<li class="off"><code>[&#xa0;]</code> qwerty option</li>
<li class="off"><code>[&#xa0;]</code> decimal separator</li>
<li class="off"><code>[&#xa0;]</code> combined amount and currency field</li>
<li class="off"><code>[&#xa0;]</code> transpose amount and currency fields

<ul class="org-ul">
<li class="on"><code>[X]</code> in settings</li>
<li class="off"><code>[&#xa0;]</code> automatically based on symbol vs name</li>
<li class="off"><code>[&#xa0;]</code> with drag and drop</li>
<li class="off"><code>[&#xa0;]</code> with an option in data entry UI</li>
</ul></li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> maybe try <a href="https://pub.dev/packages/currency_icons%20orhttps://pub.dev/packages/country_icons">https://pub.dev/packages/currency_icons orhttps://pub.dev/packages/country_icons</a></li>

<li class="off"><code>[&#xa0;]</code> add tests</li>

<li class="off"><code>[&#xa0;]</code> start an ios branch</li>

<li class="off"><code>[&#xa0;]</code> research if there's better logging idioms than <code>print</code> - some
idiomatic might be described at
<a href="https://medium.com/flutter-community/debugprint-and-the-power-of-hiding-and-customizing-your-logs-in-dart-86881df05929">https://medium.com/flutter-community/debugprint-and-the-power-of-hiding-and-customizing-your-logs-in-dart-86881df05929</a></li>

<li class="off"><code>[&#xa0;]</code> research how fastlane might benefit project in early stages</li>

<li class="off"><code>[&#xa0;]</code> work on cli, to make working on parser easier</li>

<li class="off"><code>[&#xa0;]</code> allow user to make templates for faster data entry of common
purchases</li>

<li class="off"><code>[&#xa0;]</code> add localization for Chinese, Russian, as desire is raised</li>

<li class="off"><code>[&#xa0;]</code> consider details at
<a href="https://directory.fsf.org/wiki/Free_Software_Directory:Requirements">https://directory.fsf.org/wiki/Free_Software_Directory:Requirements</a></li>

<li class="off"><code>[&#xa0;]</code> <a href="https://www.gnu.org/licenses/gpl-howto.en.html">https://www.gnu.org/licenses/gpl-howto.en.html</a></li>

<li class="off"><code>[&#xa0;]</code> fill column</li>

<li class="off"><code>[&#xa0;]</code> basic offset</li>
</ul>
</div>
</div>

<div id="outline-container-org567b808" class="outline-3">
<h3 id="partially-done"><a id="org567b808"></a>partially done</h3>
<div class="outline-text-3" id="text-partially-done">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> clean up code in add transaction form</li>
</ul>
</div>
</div>

<div id="outline-container-org21edf84" class="outline-3">
<h3 id="done-or-partially-done-but-not-yet-on-master"><a id="org21edf84"></a><span class="done DONE">DONE</span> (or partially done) but not yet on master</h3>
<div class="outline-text-3" id="text-done-or-partially-done-but-not-yet-on-master">
<ul class="org-ul">
<li class="on"><code>[X]</code> update details of project to that of current <code>flutter create</code>
template</li>
<li class="off"><code>[&#xa0;]</code> refactor repo to contain flutter project, cli project, file parsing
project. ensure this refactoring is compatible with f-droid, package
managers, etc.</li>
<li class="off"><code>[&#xa0;]</code> work on parser</li>
</ul>
</div>
</div>
</div>
